Revit 2024 API
DefaultDivideSettings.PathLayout Property
 A default Divided Path layout.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public SpacingRuleLayout PathLayout { get; set; }
Visual Basic
Public Property PathLayout As SpacingRuleLayout
	Get
	Set
Visual C++
public:
property SpacingRuleLayout PathLayout {
	SpacingRuleLayout get ();
	void set (SpacingRuleLayout value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace